# DefinitionGroups Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionGroups Methods
DefinitionGroups Class See Also
---
The DefinitionGroups type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Tests for the existence of a definition group within the collection. |
| Create | Create a new parameter definition group using the name provided. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Retrieves an enumerator to the collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace